//
//  Error.strings
//  Nextcloud iOS
//
//  Copyright (c) 2017 TWS. All rights reserved.
//
//  Author Marino Faggiana <m.faggiana@twsweb.it>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//


"_bad_username_password_"               = "Nome de utilizador ou palavra-passe errados";
"_cancelled_by_user"                    = "Transferência cancelada";
"_error_folder_destiny_is_the_same_"    = "It is not possible to move the folder into itself";
"_error_not_permission_"                = "Não tem permissões para completar a operação";
"_error_path_"                          = "Não é possível abrir ficheiro ou pasta. Certifique-se que existe.";
"_file_upload_not_exitst_"              = "The file that you want to upload does not exist";
"_forbidden_characters_from_server_"    = "O nome contêm pelo menos um caracter inválido";
"_not_connected_internet_"              = "Erro de conexão ao servidor ";
"_not_possible_connect_to_server_"      = "Não é possível conectar-se ao servidor nesta altura";
"_not_possible_create_folder_"          = "Pasta não pôde ser criada";
"_server_down_"                         = "Could not establish contact with server";
"_time_out_"                            = "Terminou o tempo, tente novamente";
"_unknow_response_server_"              = "Responsa inesperada do servidor";
"_user_autentication_required_"         = "Necessária autenticação do utilizador";
"_file_directory_locked_"               = "Ficheiro ou pasta bloqueados";
"_ssl_certificate_untrusted_"           = "O certificado para este servidor é inválido";
"_internal_server_"                     = "Internal server error";
"_file_already_exists_"                 = "Could not complete the operation, a file with the same name exists";
"_file_folder_not_exists_"              = "Não foi possível encontrar o ficheiro original no caminho especificado";
"_folder_contents_nochanged_"           = "O conteúdo da pasta não foi alterado";
"_images_invalid_converted_"            = "A imagem é inválida e não pode ser convertida para miniatura";
"_method_not_expected_"                 = "Unexpected request method";
"_reauthenticate_user_"                 = "Access expired, log in again";
"_server_error_retry_"                  = "O servidor está temporariamente indisponível";
"_too_many_files_"                      = "Too many files would be involved in this operation";
"_too_many_request_"                    = "Sending too many requests caused the rate limit to be reached";
"_user_over_quota_"                     = "Cota de armazenamento alcançada";
"_ssl_connection_error_"                = "Erro de conexão SSL, tente novamente";
"_bad_request_"                         = "Pedido errado";
"_webdav_locked_"                       = "WebDAV Locked: Trying to access locked resource";
"_error_user_not_available_"            = "The user is no longer available";
"_server_response_error_"               = "Server response content error";


